{
  "header.buttons.home": "Home",
  "header.buttons.about": "About Me",
  "header.buttons.resume": "Skills",
  "header.buttons.projects": "Projects",
  "header.buttons.contact": "Contact",

  "about.resume.section": "Resume",
  "about.resume.paragraph.first.part.one": "I am a young ",
  "about.resume.paragraph.first.part.two": " years old technology enthusiast with a great desire to continue advancing in my professional career. I graduated in Computer Engineering from Carlos III University of Madrid, where I acquired solid theoretical knowledge and applied it in practical projects that strengthened my technical skills.",
  "about.resume.paragraph.second.part.one": "Currently, I work as a software developer at ",
  "about.resume.paragraph.second.part.two": ", an experience that has allowed me to consolidate my skills in software development and project management. I am especially interested in web and mobile application development, but I am also passionate about emerging areas such as artificial intelligence, machine learning, BigData, cybersecurity and DevOps.",
  "about.value.section": "What can I bring?",
  "about.value.paragraph.first.part.one": "With ",
  "about.value.paragraph.first.part.two": " years of experience in the technology sector, I bring solid knowledge in software development, web development and agile project management methodologies. My practical experience and my enthusiasm for learning make me an adaptable professional in constant evolution, prepared to face new challenges and bring value to the teams I collaborate with.",

  "about.timeline.university.section": "University",
  "about.timeline.university.name": "Carlos III University of Madrid",
  "about.timeline.university.period": "Period: ",
  "about.timeline.university.period.value": "2018 - 2023",
  "about.timeline.university.degree": "Degree: ",
  "about.timeline.university.degree.value": "Bachelor's Degree in Computer Science",
  "about.timeline.university.description": "Description: ",
  "about.timeline.university.description.point.one": "- Studies focused on software development, algorithms, and IT project management.",
  "about.timeline.university.description.point.two": "- Field: Computing.",
  "about.timeline.practices.section": "Junior Internship (Santander Bank-USA)",
  "about.timeline.practices.company": "Keifitech Company",
  "about.timeline.practices.period": "Period: ",
  "about.timeline.practices.period.value": "December 2021 - June 2022",
  "about.timeline.practices.position": "Position: ",
  "about.timeline.practices.position.value": "FullStack Developer",
  "about.timeline.practices.description": "Description: ",
  "about.timeline.practices.description.point.one": "- Participation in web development projects using Angular and UI design.",
  "about.timeline.practices.description.point.two": "- Development of servers using SpringBoot Java.",
  "about.timeline.practices.description.point.three": "- Development of APIs with Mulesoft.",
  "about.timeline.fullstack.section": "FullStack Developer (Santander Bank-USA)",
  "about.timeline.fullstack.company": "Keifitech Company",
  "about.timeline.fullstack.period": "Period: ",
  "about.timeline.fullstack.period.value": "2022 - Present",
  "about.timeline.fullstack.position": "Position: ",
  "about.timeline.fullstack.position.value": "Full Stack Developer",
  "about.timeline.fullstack.description": "Description: ",
  "about.timeline.fullstack.description.point.one": "- Participation in web development projects using Angular and UI design.",
  "about.timeline.fullstack.description.point.two": "- Development of servers using SpringBoot Java and Gluon.",
  "about.timeline.fullstack.description.point.three": "- Development of APIs with Mulesoft.",
  "about.timeline.fullstack.description.point.four": "- Member of the Governance team, performing tasks such as Code Reviews and merges to Preproduction and Production.",

  "resume.technologies": "Technologies",
  "resume.technologies.text": "Why don't you try dragging the cards?...",
  "resume.card.common.certificates": "Certificates",

  "resume.card.angular.experience": "01/07/2020/of experience",
  "resume.card.angular.information.versions": "From V14 to V19 (last)",
  "resume.card.angular.information.basics": "Angular Basics",
  "resume.card.angular.information.basics.list": "Components, Directives, Services, Pipes, Modules, Routing, Forms, Observables, Http, Guards, Interceptors, Lazy Loading, Hooks",
  "resume.card.angular.information.advanced": "Angular Advanced",
  "resume.card.angular.information.advanced.list": "Rxjs, Defers, Transitions, Animations, Standalone Components, Custom Pipes, Custom Directives, Signals, SSR",
  "resume.card.angular.information.libraries": "Libraries",
  "resume.card.angular.information.libraries.list": "Angular Material, Bootstrap, Primeng, Primeflex, Tailwind, iframe, GSAP",
  "resume.card.angular.information.others": "Others",
  "resume.card.angular.information.others.list": "Docker, Jira, Netlify, Vercel, Firebase, MongoDb, SVG, MapBox",

  "resume.card.docker.experience": "01/08/2024/of experience",
  "resume.card.docker.information.versions": "V27 (last)",
  "resume.card.docker.information.basics": "Docker Basics",
  "resume.card.docker.information.basics.list": "Containers, Images, Dockerfile, Docker Ignore, Volumes, Networks",
  "resume.card.docker.information.advanced": "Docker Advanced",
  "resume.card.docker.information.advanced.list": "Docker Compose, Build, BuildX, Docker Hub, Multi Stage, Registries",
  "resume.card.docker.information.others": "Others",
  "resume.card.docker.information.others.list": "Digital Ocean, Kubernetes, GitHub Actions, NgInx",

  "resume.card.github.experience": "01/08/2021/of experience",
  "resume.card.github.information.basics": "Git Basics",
  "resume.card.github.information.basics.list": "Repositories, Branches, Commits, Merge, Pull, Push, Fetch, Clone, Fork, Branch, Checkout, Reset, Revert, Stash, Tag, Rebase",
  "resume.card.github.information.advanced": "GitHub Advanced",
  "resume.card.github.information.advanced.list": "Actions, Disscusions, GitIgnore, GitConfig, Workflows, Secrets, Pull Request, Readme",

  "resume.card.mongodb.experience": "01/12/2024/of experience",
  "resume.card.mongodb.information.versions": "v8.0",
  "resume.card.mongodb.information.basics": "MongoDB Basics",
  "resume.card.mongodb.information.basics.list": "Databases, Collections, Documents, Queries, MongoDB Shell, MongoDB Compass, Indexes, Aggregations",
  "resume.card.mongodb.information.advanced": "MongoDB Advanced",
  "resume.card.mongodb.information.advanced.list": "Replication, Sharding, Backup and Restore, Security, Performance, MongoDB Atlas",
  "resume.card.mongodb.information.others": "Others",
  "resume.card.mongodb.information.others.list": "Geospatial Indexes",

  "resume.card.mulesoft.experience": "20/12/2021/of experience",
  "resume.card.mulesoft.information.versions": "v4.4",
  "resume.card.mulesoft.information.basics": "Mulesoft Basics",
  "resume.card.mulesoft.information.basics.list": "APIs, Connectors, Flows, Transforms, Vars, Validations, Properties, Error Handling, Logs, Debugging",
  "resume.card.mulesoft.information.advanced": "Mulesoft Advanced",
  "resume.card.mulesoft.information.advanced.list": "API Manager, Anypoint Studio, Anypoint Platform, IBM Api Connect, DataWeave, MUnit, APIKit, RAML, YAML, SOAP, REST, DB, JWT",
  "resume.card.mulesoft.information.others": "Others",
  "resume.card.mulesoft.information.others.list": "Postman, Swagger, OpenAPI, Jenkins, Code Review",

  "resume.card.springboot.experience": "20/12/2021/of experience",
  "resume.card.springboot.information.versions": "v3.3.4",
  "resume.card.springboot.information.basics": "SpringBoot Basics",
  "resume.card.springboot.information.basics.list": "Controllers, Services, Repositories, Entities, DTOs, Security, JWT, CORS, Swagger, Properties, Logs, Inheritance",
  "resume.card.springboot.information.advanced": "SpringBoot Advanced",
  "resume.card.springboot.information.advanced.list": "Threads, Reactive Programming, WebSockets, WebFlux, WebClient, RestTemplate, JDBC, JPA, Hibernate, MapStruct, Caching, Validations, Test",
  "resume.card.springboot.information.others": "Others",
  "resume.card.springboot.information.others.list": "SonarQube, Code Review, Fortify, OpenAPI, Darwin, Gluon",

  "resume.card.react.experience": "20/12/2021/of experience",
  "resume.card.react.information.versions": "v19",
  "resume.card.react.information.basics": "React Basics",
  "resume.card.react.information.basics.list": "Components, Props, State, Hooks, Context, Refs, Lifecycle, Events, Render, JSX, CSS, Sass",
  "resume.card.react.information.advanced": "React Advanced",
  "resume.card.react.information.advanced.list": "Redux, Router, Axios, Fetch, Promises, Async/Await, Testing, Debugging, Personalized Hooks, SSR",
  "resume.card.react.information.libraries": "Libraries",
  "resume.card.react.information.libraries.list": "Bootstrap, Tailwind, GSAP, Material UI, PrimeReact, PrimeIcons, Reactstrap, React Router, React Query",
  "resume.card.react.information.others": "Others",
  "resume.card.react.information.others.list": "iframe, Docker, Jira, Netlify, Vercel, Firebase, MongoDb, SVG, MapBox",

  "resume.card.jira.experience": "20/12/2021/of experience",
  "resume.card.jira.information.versions": "v10.2",
  "resume.card.jira.information.basics": "Jira Basics",
  "resume.card.jira.information.basics.list": "Proyects, Tables, Epics, Histories, Tasks, Subtasks, Bugs, Improvements, New Functionalities, Versions, Sprints, Kanban, Scrum",
  "resume.card.jira.information.others": "Others",
  "resume.card.jira.information.others.list": "Confluence, Trello",

  "resume.card.kubernetes.experience": "01/08/2024/of experience",
  "resume.card.kubernetes.information.versions": "v27.1",
  "resume.card.kubernetes.information.basics": "Kubernetes Basics",
  "resume.card.kubernetes.information.basics.list": "Pods, Deployments, Services, Ingress, ConfigMaps, Secrets, Namespaces, Volumes",
  "resume.card.kubernetes.information.others": "Others",
  "resume.card.kubernetes.information.others.list": "Helm, Minikube",

  "resume.card.flask.experience": "01/01/2022/of experience",
  "resume.card.flask.information.versions": "v3.0.1",
  "resume.card.flask.information.basics": "Flask Basics",
  "resume.card.flask.information.basics.list": "Routes, Views, Templates, Forms, Models, Sessions, Cookies, Security",
  "resume.card.flask.information.others": "Others",
  "resume.card.flask.information.others.list": "MySQL, PostgreSQL, Firebase, MongoDB, Redis, JWT, CORS, Swagger, OpenAPI",

  "resume.card.jupiter.experience": "01/06/2024/of experience",
  "resume.card.jupiter.information.versions": "v7.3.1",
  "resume.card.jupiter.information.basics": "Jupyter Basics",
  "resume.card.jupiter.information.basics.list": "Notebooks, Cells, Kernels, Magic Commands, Markdown, Code, DataFrames, Plots, Widgets",
  "resume.card.jupiter.information.others": "Others",
  "resume.card.jupiter.information.others.list": "Machine Learning, Big Data, Data Science",

  "resume.card.aptitudes.experience": "20/12/2021/of experience",
  "resume.card.aptitudes.information.versions": "",
  "resume.card.aptitudes.information.basics": "Aptitudes",
  "resume.card.aptitudes.information.basics.list": "Resolute, Proactive, Teamwork, Communication, Empathy, Creativity, Organization, Adaptability, Continuous Learning",

  "project.type": "Type",
  "project.type.personal": "Personal",
  "project.type.course": "Course",
  "project.type.company": "Company",
  "project.github": "See on GitHub",
  "project.technologies": "Technologies",

  "project.card.portfolio.description": "This project, developed with Angular v19, includes interesting features such as dynamic animations, location detection to automatically set the language, and a fully responsive structure. Through it, I aimed to showcase everything I can achieve with my current skills, serving as a professional introduction.",
  "project.card.santandermuleSoft.description": "I developed numerous APIs and microservices in MuleSoft v3.9 and v4.4 for Banco Santander USA, following the bank's guidelines and applying best development practices. These services were integrated with existing internal systems, such as other APIs, databases (DB), TRX components, and third-party platforms. I used tools like MUnit for unit testing, Postman collections for integration testing, and Kibana for real-time monitoring. Deployment was managed via Jenkins, ensuring continuous service lifecycle management. I was involved in all project phases, from definition to implementation, testing, deployment, and monitoring. One of the main challenges was adhering to the strict standards defined by the bank's governance team, following the institutional data dictionary, and overcoming MuleSoft's limitations when implementing complex features such as loops and conditions within integration flows.",
  "project.card.santanderspringboot01.description": "I developed a project that acted as an intermediary between the bank's APIs and internal systems. Its main functionality was to receive data in JSON format, transform it into SOAP using an XSD schema, and process the response to convert it back into JSON. I participated in all stages of development, from the initial design to production deployment, including its maintenance and the implementation of required changes or adjustments. This project ensured seamless integration between heterogeneous systems, improving interoperability and optimizing internal processes.",
  "project.card.santanderspringboot02.description": "Development of an advanced automation process to analyze Java code and extract key characteristics. The main objective was to identify and map project dependencies, showing how they interacted with each other on a portal. The process identified REST calls, database (DB) accesses, interactions with components called TRX, and performed data mappings, among others. The main challenge was to find the appropriate entry point in the Java code, which could be a controller in REST projects or an event method (one not invoked by other components) in event-based projects. To implement this analysis, the JavaParser library was used, enabling deep syntactic analysis. This project replicated an existing functionality for MuleSoft, adapting it to Java, which proved more complex due to Java code's inherent flexibility compared to MuleSoft's structured XML code. The result was a system capable of facilitating the visualization and understanding of interdependencies between projects, significantly improving traceability and technical analysis.",
  "project.card.santanderspringboot03.description": "The bank required replicating the automation and analysis processes implemented in Mulesoft, adapting them to integrate with the Gluon projects. To achieve this, it was necessary to clone and modify the existing code, design new tables, and create a new batch process that, by scanning all the projects deployed in OpenShift environments, would detect changes compared to what was already stored in the databases. Additionally, an existing project was adapted to compare the recorded differences with the new changes, allowing the identification of microservices that had updated their version. This project was key to generating the bank's weekly report, ensuring traceability of the updates.",
  "project.card.santanderspringboot04.description": "Project developed in Spring Boot to enhance a functionality in the bank's internal portal. It involved optimizing methods and database queries that retrieved property information through a system based on YAML files, where values were replaced with keys. The objective was to improve the system's efficiency and performance in managing these dynamic configurations.",
  "project.card.santandergluon01.description": "The bank was undergoing a migration from MuleSoft to Gluon, which required the development of a REST library based on WebClient. This library aimed to centralize and standardize all calls made by the microservices in Gluon, ensuring consistency and efficiency in communications. Additionally, the library was designed to simplify and optimize the bank's analysis and automation processes, providing a solid foundation to enhance the quality and traceability of integrations.",
  "project.card.santanderangular01.description": "I participated in the final development stages of two key portals for the bank. The first portal was customer-facing, allowing users to perform various actions such as transactions, among others. In this project, I made adjustments to the login and registration functionalities and developed a screen with multiple sections organized in a stepper format. The second portal was designed for administrators, where errors generated by users were managed. In this portal, I implemented various functional improvements, performed general optimizations across the application, and developed additional, non-required enhancements, contributing to a more efficient and robust experience.",
  "project.card.santanderangular02.description": "I developed several tabs for an internal bank portal, designed with a permission system that distinguished between developers and governance members. I implemented numerous tables using Angular Material, integrating advanced features such as filters, responsive design, and other enhancements to optimize the user experience. Additionally, I carried out improvements and optimizations beyond the initial requirements, contributing to better system performance and usability."

}

