{
  "header.buttons.home": "Inicio",
  "header.buttons.about": "Sobre mi",
  "header.buttons.resume": "Habilidades",
  "header.buttons.projects": "Proyectos",
  "header.buttons.contact": "Contacto",

  "about.resume.section": "Resumen",
  "about.resume.paragraph.first.part.one": "Soy un joven de ",
  "about.resume.paragraph.first.part.two": " años apasionado por la tecnología y con un gran deseo de seguir avanzando en mi carrera profesional. Me gradué en Ingeniería Informática en la Universidad Carlos III de Madrid, donde adquirí sólidos conocimientos teóricos y los apliqué en proyectos prácticos que fortalecieron mis habilidades técnicas.",
  "about.resume.paragraph.second.part.one": "Actualmente, trabajo como desarrollador de software en ",
  "about.resume.paragraph.second.part.two": ", una experiencia que me ha permitido consolidar mis habilidades en el desarrollo de software y la gestión de proyectos. Estoy especialmente interesado en el desarrollo web y de aplicaciones móviles, pero también me apasionan áreas emergentes como la inteligencia artificial, el machine learning, el BigData, la ciberseguridad y el DevOps.",
  "about.value.section": "¿Qué puedo aportar?",
  "about.value.paragraph.first.part.one": "Con ",
  "about.value.paragraph.first.part.two": " años de experiencia en el sector tecnológico, aporto conocimientos sólidos en desarrollo de software, desarrollo web y metodologías ágiles de gestión de proyectos. Mi experiencia práctica y mi entusiasmo por aprender me convierten en un profesional adaptable y en constante evolución, preparado para enfrentar nuevos desafíos y aportar valor a los equipos con los que colaboro.",

  "about.timeline.university.section": "Universidad",
  "about.timeline.university.name": "Universidad Carlos III de Madrid",
  "about.timeline.university.period": "Período: ",
  "about.timeline.university.period.value": "2018 - 2023",
  "about.timeline.university.degree": "Título: ",
  "about.timeline.university.degree.value": "Grado en Ingeniería Informática",
  "about.timeline.university.description": "Descripción: ",
  "about.timeline.university.description.point.one": "- Estudios centrados en el desarrollo de software, algoritmos, y gestión de proyectos IT.",
  "about.timeline.university.description.point.two": "- Rama: Computación.",
  "about.timeline.practices.section": "Prácticas Junior (Banco Santander-USA)",
  "about.timeline.practices.company": "Empresa Keifitech",
  "about.timeline.practices.period": "Período: ",
  "about.timeline.practices.period.value": "Diciembre 2021 - Junio 2022",
  "about.timeline.practices.position": "Posición: ",
  "about.timeline.practices.position.value": "Desarrollador FullStack",
  "about.timeline.practices.description": "Descripción: ",
  "about.timeline.practices.description.point.one": "- Participación en proyectos de desarrollo web con Angular y diseño de interfaces gráficas.",
  "about.timeline.practices.description.point.two": "- Desarrollo de servidores en SpringBoot Java.",
  "about.timeline.practices.description.point.three": "- Desarrollo de APIs en Mulesoft.",
  "about.timeline.fullstack.section": "Desarrollador FullStack (Banco Santander-USA)",
  "about.timeline.fullstack.company": "Empresa Keifitech",
  "about.timeline.fullstack.period": "Período: ",
  "about.timeline.fullstack.period.value": "2022 - Actualidad",
  "about.timeline.fullstack.position": "Posición: ",
  "about.timeline.fullstack.position.value": "Desarrollador Full Stack",
  "about.timeline.fullstack.description": "Descripción: ",
  "about.timeline.fullstack.description.point.one": "- Participación en proyectos de desarrollo web con Angular y diseño de interfaces gráficas.",
  "about.timeline.fullstack.description.point.two": "- Desarrollo de servidores en SpringBoot Java y Gluon.",
  "about.timeline.fullstack.description.point.three": "- Desarrollo de APIs en Mulesoft.",
  "about.timeline.fullstack.description.point.four": "- Integrante del equipo de Gobierno encargado de realizar diversas tareas como Code Reviews y merges a Preproducción y Producción.",

  "resume.technologies": "Tecnologias",
  "resume.technologies.text": "¿Porque no intentas arrastrar las tarjetas?...",
  "resume.card.common.certificates": "Certificados",

  "resume.card.angular.experience": "01/07/2020/de experiencia",
  "resume.card.angular.information.versions": "De la V14 a la V19 (última)",
  "resume.card.angular.information.basics": "Basicos de Angular",
  "resume.card.angular.information.basics.list": "Componentes, Directivas, Servicios, Pipes, Módulos, Routing, Formularios, Observables, Http, Guards, Interceptors, Lazy Loading, Hooks",
  "resume.card.angular.information.advanced": "Angular Avanzado",
  "resume.card.angular.information.advanced.list": "Rxjs, Defers, Transiciones, Animaciones, Standalone Componentes, Pipes personalizados, Directivas personalizadas, Señales, SSR",
  "resume.card.angular.information.libraries": "Librerías",
  "resume.card.angular.information.libraries.list": "Angular Material, Bootstrap, Primeng, Primeflex, Tailwind, GSAP",
  "resume.card.angular.information.others": "Otros",
  "resume.card.angular.information.others.list": "iframe, Docker, Jira, Netlify, Vercel, Firebase, MongoDb, SVG, MapBox",

  "resume.card.docker.experience": "01/08/2024/de experiencia",
  "resume.card.docker.information.versions": "V27 (última)",
  "resume.card.docker.information.basics": "Basicos de Docker",
  "resume.card.docker.information.basics.list": "Contenedores, Imágenes, Dockerfile, Docker Ignore, Volumenes, Redes",
  "resume.card.docker.information.advanced": "Docker Avanzado",
  "resume.card.docker.information.advanced.list": "Docker Compose, Build, BuildX, Docker Hub, Multi Stage, Registros",
  "resume.card.docker.information.others": "Otros",
  "resume.card.docker.information.others.list": "Digital Ocean, Kubernetes, GitHub Actions, NgInx",

  "resume.card.github.experience": "01/08/2021/de experiencia",
  "resume.card.github.information.basics": "Basicos de Git",
  "resume.card.github.information.basics.list": "Repositorios, Ramas, Commits, Merge, Pull, Push, Fetch, Clone, Fork, Branch, Checkout, Reset, Revert, Stash, Tag, Rebase",
  "resume.card.github.information.advanced": "GitHub Avanzado",
  "resume.card.github.information.advanced.list": "Actions, Disscusions, GitIgnore, GitConfig, Workflows, Secrets, Pull Request, Readme",

  "resume.card.mongodb.experience": "01/12/2024/de experiencia",
  "resume.card.mongodb.information.versions": "v8.0",
  "resume.card.mongodb.information.basics": "Basicos de MongoDB",
  "resume.card.mongodb.information.basics.list": "Bases de datos, Colecciones, Documentos, Consultas, MongoDB Shell, MongoDB Compass, Índices, Agregaciones",
  "resume.card.mongodb.information.advanced": "MongoDB Avanzado",
  "resume.card.mongodb.information.advanced.list": "Replicación, Sharding, Backup y Restore, Seguridad, Rendimiento, MongoDB Atlas",
  "resume.card.mongodb.information.others": "Otros",
  "resume.card.mongodb.information.others.list": "Índices Geoespaciales",

  "resume.card.mulesoft.experience": "20/12/2021/de experiencia",
  "resume.card.mulesoft.information.versions": "v4.4",
  "resume.card.mulesoft.information.basics": "Basicos de Mulesoft",
  "resume.card.mulesoft.information.basics.list": "APIs, Conectores, Flujos, Transformaciones, Variables, Validaciones, Propiedades, Manejo de Errores, Logs, Debugging",
  "resume.card.mulesoft.information.advanced": "Mulesoft Avanzado",
  "resume.card.mulesoft.information.advanced.list": "API Manager, Anypoint Studio, Anypoint Platform, IBM Api Connect, DataWeave, MUnit, APIKit, RAML, YAML, SOAP, REST, DB, JWT",
  "resume.card.mulesoft.information.others": "Otros",
  "resume.card.mulesoft.information.others.list": "Postman, Swagger, OpenAPI, Jenkins, Code Review",

  "resume.card.springboot.experience": "20/12/2021/de experiencia",
  "resume.card.springboot.information.versions": "v3.3.4",
  "resume.card.springboot.information.basics": "Basicos de SpringBoot",
  "resume.card.springboot.information.basics.list": "Controladores, Servicios, Repositorios, Entidades, DTOs, Seguridad, JWT, CORS, Swagger, Propiedades, Logs, Herencia",
  "resume.card.springboot.information.advanced": "SpringBoot Avanzado",
  "resume.card.springboot.information.advanced.list": "Hilos, Programación Reactiva, WebSockets, WebFlux, WebClient, RestTemplate, JDBC, JPA, Hibernate, MapStruct, Caching, Validaciones, Test",
  "resume.card.springboot.information.others": "Otros",
  "resume.card.springboot.information.others.list": "SonarQube, Code Review, Fortify, OpenAPI, Darwin, Gluon",

  "resume.card.react.experience": "20/12/2021/de experiencia",
  "resume.card.react.information.versions": "v19",
  "resume.card.react.information.basics": "Basicos de React",
  "resume.card.react.information.basics.list": "Componentes, Props, State, Hooks, Context, Refs, Lifecycle, Eventos, Render, JSX, CSS, Sass",
  "resume.card.react.information.advanced": "React Avanzado",
  "resume.card.react.information.advanced.list": "Redux, Router, Axios, Fetch, Promises, Async/Await, Testing, Debugging, Hooks personalizados, SSR",
  "resume.card.react.information.libraries": "Librerías",
  "resume.card.react.information.libraries.list": "Bootstrap, Tailwind, GSAP, Material UI, PrimeReact, PrimeIcons, Reactstrap, React Router, React Query",
  "resume.card.react.information.others": "Otros",
  "resume.card.react.information.others.list": "iframe, Docker, Jira, Netlify, Vercel, Firebase, MongoDb, SVG, MapBox",

  "resume.card.jira.experience": "20/12/2021/de experiencia",
  "resume.card.jira.information.versions": "v10.2",
  "resume.card.jira.information.basics": "Basicos de Jira",
  "resume.card.jira.information.basics.list": "Proyectos, Tableros, Epics, Historias, Tareas, Subtareas, Bugs, Mejoras, Nuevas Funcionalidades, Versiones, Sprints, Kanban, Scrum",
  "resume.card.jira.information.others": "Otros",
  "resume.card.jira.information.others.list": "Confluence, Trello",

  "resume.card.kubernetes.experience": "01/08/2024/de experiencia",
  "resume.card.kubernetes.information.versions": "v27.1",
  "resume.card.kubernetes.information.basics": "Basicos de Kubernetes",
  "resume.card.kubernetes.information.basics.list": "Pods, Deployments, Services, Ingress, ConfigMaps, Secrets, Namespaces, Volumes",
  "resume.card.kubernetes.information.others": "Otros",
  "resume.card.kubernetes.information.others.list": "Helm, Minikube",

  "resume.card.flask.experience": "01/01/2022/de experiencia",
  "resume.card.flask.information.versions": "v3.0.1",
  "resume.card.flask.information.basics": "Basicos de Flask",
  "resume.card.flask.information.basics.list": "Rutas, Métodos, Plantillas, Formularios, Sesiones, Cookies, Contextos",
  "resume.card.flask.information.others": "Otros",
  "resume.card.flask.information.others.list": "MySQL, PostgreSQL, Firebase, MongoDB, Redis, JWT, CORS, Swagger, OpenAPI",

  "resume.card.jupiter.experience": "01/06/2024/de experiencia",
  "resume.card.jupiter.information.versions": "v7.3.1",
  "resume.card.jupiter.information.basics": "Basicos de Jupiter Notebook",
  "resume.card.jupiter.information.basics.list": "Celdas, Markdown, Código, Resultados, Variables, Funciones, Gráficos, Estadísticas",
  "resume.card.jupiter.information.others": "Otros",
  "resume.card.jupiter.information.others.list": "Machine Learning, Big Data, Data Science",

  "resume.card.aptitudes.experience": "20/12/2021/de experiencia",
  "resume.card.aptitudes.information.versions": "",
  "resume.card.aptitudes.information.basics": "Aptitudes Personales",
  "resume.card.aptitudes.information.basics.list": "Resolutivo, Proactivo, Trabajo en Equipo, Comunicación, Empatía, Creatividad, Organización, Adaptabilidad, Aprendizaje Continuo",


  "project.type": "Tipo",
  "project.type.personal": "Personal",
  "project.type.course": "Curso",
  "project.type.company": "Empresa",
  "project.github": "Ver en GitHub",
  "project.technologies": "Tecnologías",

  "project.card.portfolio.description": "Este proyecto, desarrollado con Angular v19, incorpora características interesantes como animaciones dinámicas, detección de ubicación para ajustar automáticamente el idioma, y una estructura completamente responsive. Con él, he querido plasmar todo lo que soy capaz de lograr con mis conocimientos actuales, funcionando como una carta de presentación profesional.",
  "project.card.santandermuleSoft.description": "Desarrollé numerosas APIs y microservicios en MuleSoft v3.9 y v4.4 para el Banco Santander USA, siguiendo las directrices del banco y aplicando las mejores prácticas de desarrollo. Estos servicios se integraron con sistemas internos existentes, como otras APIs, bases de datos (BBDD), componentes TRX, y plataformas de terceros. Utilicé herramientas como MUnit para pruebas unitarias, colecciones de Postman para pruebas de integración, y Kibana para la monitorización en tiempo real. El despliegue se gestionó mediante Jenkins, asegurando la continuidad del ciclo de vida de los servicios. Participé en todas las fases del proyecto, desde la definición hasta la implementación, pruebas, despliegue y monitorización. Uno de los principales desafíos fue adherirse a los estándares estrictos definidos por el equipo de gobierno del banco, seguir el diccionario de datos institucional, y superar las limitaciones de MuleSoft al implementar funcionalidades complejas como bucles y condiciones dentro de los flujos de integración.",
  "project.card.santanderspringboot01.description": "Desarrollé un proyecto que funcionaba como un intermediario entre las APIs del banco y los sistemas internos. Su funcionalidad principal consistía en recibir datos en formato JSON, transformarlos a SOAP mediante un esquema XSD, y procesar la respuesta para convertirla nuevamente a JSON. Participé en todas las etapas del desarrollo, desde el diseño inicial hasta el despliegue en producción, incluyendo su mantenimiento y la implementación de cambios o ajustes requeridos. Este proyecto aseguró una integración fluida entre sistemas heterogéneos, mejorando la interoperabilidad y optimizando los procesos internos.",
  "project.card.santanderspringboot02.description": "Desarrollo de un proceso de automatización avanzado para analizar código Java y extraer características clave. El objetivo principal era identificar y mapear las dependencias de los proyectos, mostrando cómo interactuaban entre sí en un portal. El proceso identificaba llamadas REST, accesos a bases de datos (BBDD), interacciones con componentes denominados TRX, y realizaba mapeos de datos, entre otros. El principal desafío fue encontrar el punto de entrada adecuado en el código Java, que podía ser un controlador en proyectos REST o un método de evento (aquel que no es invocado por otros componentes) en proyectos basados en eventos. Para implementar este análisis, se utilizó la biblioteca JavaParser, que permitió realizar un análisis sintáctico profundo. Este proyecto replicó una funcionalidad existente para MuleSoft, adaptándola a Java, lo cual resultó más complejo debido a la flexibilidad inherente al código Java en comparación con el código XML estructurado de MuleSoft. El resultado fue un sistema capaz de facilitar la visualización y el entendimiento de las interdependencias entre proyectos, mejorando significativamente la trazabilidad y el análisis técnico.",
  "project.card.santanderspringboot03.description": "El banco requirió replicar los procesos de automatización y análisis implementados en Mulesoft, adaptándolos para integrarse con los proyectos de Gluon. Para lograrlo, fue necesario clonar y modificar el código existente, diseñar nuevas tablas, y crear un nuevo proceso batch, que mediante escanear todos los proyectos desplegados en los entornos de OpenShift, detectaria los cambios con lo que ya se tenia guardado en BBDD. Además, se adaptó un proyecto existente que comparaba las diferencias registradas con los nuevos cambios, permitiendo identificar los microservicios que habían actualizado su versión. Este proyecto resultó clave para generar el reporte semanal del banco, garantizando la trazabilidad de las actualizaciones.",
  "project.card.santanderspringboot04.description": "Proyecto desarrollado en Spring Boot para la mejora de una funcionalidad en el portal interno del banco. Consistió en optimizar métodos y llamadas a bases de datos que recuperaban información de propiedades mediante un sistema basado en archivos YAML, donde los valores eran reemplazados por claves. El objetivo fue mejorar la eficiencia y el rendimiento del sistema al gestionar estas configuraciones dinámicas.",
  "project.card.santandergluon01.description": "El banco estaba llevando a cabo una migración de MuleSoft a Gluon, lo que requirió el desarrollo de una biblioteca REST basada en WebClient. Esta biblioteca tenía como objetivo centralizar y estandarizar todas las llamadas realizadas por los microservicios en Gluon, garantizando consistencia y eficiencia en las comunicaciones. Además, la biblioteca fue diseñada para simplificar y optimizar los procesos de análisis y automatización utilizados por el banco, proporcionando una base sólida para mejorar la calidad y la trazabilidad de las integraciones.",
  "project.card.santanderangular01.description": "Participé en las etapas finales de desarrollo de dos portales clave para el banco. El primer portal estaba dirigido a los clientes, permitiéndoles realizar diversas acciones, como transacciones, entre otras. En este proyecto, realicé ajustes en las funcionalidades de inicio de sesión y registro, además de desarrollar una pantalla con múltiples secciones organizadas en un formato de stepper. El segundo portal estaba orientado a administradores, donde se gestionaban los errores generados por los usuarios. En este portal, llevé a cabo diversas mejoras funcionales, optimizaciones generales en la aplicación y desarrollé mejoras adicionales no requeridas, contribuyendo a una experiencia más eficiente y robusta.",
  "project.card.santanderangular02.description": "Desarrollé varias pestañas en un portal interno del banco, diseñado con un sistema de permisos que diferenciaba entre desarrolladores y miembros de gobierno. Implementé numerosas tablas utilizando Angular Material, integrando funcionalidades avanzadas como filtros, diseño responsivo y otras mejoras para optimizar la experiencia del usuario. Además, llevé a cabo mejoras y optimizaciones adicionales en la aplicación que no formaban parte de los requisitos iniciales, contribuyendo a un mejor rendimiento y usabilidad del sistema."

}
